#include <stdio.h>
/**
 * @brief Вычисляет пройденный путь по течению с за данными числами 
 * @param side пройденное расстояние 
 * @return Рассчитанное значение
 */
double s(const double side);
/**
 * @brief Считывает с клавиатуры занчение с плавающей точкой
 * @return Считанное значение
 */
 double getDouble();
 /**
 * @brief Точка входа в программу
 * @return 0, если программа выполнена корректно, иначе не 0
 */
int main()
{
    double v1, v2, t, s;

    printf("Введите скорость лодки в стоячем положении: ");
    scanf("%lf", &v1);
    printf("Введите скорость течение реки: ");
    scanf("%lf", &v2);
    printf("Введите время движения: ");
    scanf("%lf", &t);

    s = (v1 + v2) * t;

    printf(" S = %f\n", s);

    return 0;
}
